alter.org
#+TITLE: ソースコード講読 alter.c
#+AUTHOR: 井上優作
#+LANG: ja
#+OPTIONS: toc:nil num:nil

* ALTER TABLEについて

  SQLite3の ~ALTER TABLE~ コマンドは、テーブルの名前を変更するか、またはカラムを追加することができるコマンドである。以下のようにして実行する。

  #+BEGIN_SRC
ALTER TABLE tbl RENAME TO new_table_name
ALTER TABLE tbl ADD COLUMN column-def
  #+END_SRC

* ソースコード

  - L21: このファイルのコードは、ビルド時に ~ALTER TABLE~ コマンドを除かない限り存在する。

** LL.37-84 static void renameTableFunc()

   コメント中にあるコード例の引数が、この関数の第3引数に配列( ~**argv~ )となって入っている。42-43行目で、SQL文とテーブルの名前が取り出されている。テーブル名の特定規則は、 ~TK_LP~ または ~TK_USING~ の後に続く最初のスペースでないトークンであるとしており、これを59−78行目で実行している。この関数自体は返り値は ~void~ だが、80行目の ~zRet~ が実質的な返り値？　

** LL.102-148 static void renameParentFunc()

   外部キー制約の定義を修正するための関数。120−127行目で古い名前を探して、129−138行目でそれを新しい名前に変更しているような気がする。
